---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.WiringType.Chamfer
enum: Autodesk.Revit.DB.Electrical.WiringType
source: html/fb484864-f9d0-7335-1f91-d7ac587f15fb.htm
---
# Autodesk.Revit.DB.Electrical.WiringType.Chamfer

Chamfered wiring can be used to indicate wiring that is exposed.